<?php
/*读取excel文件，并进行相应处理*/
$fileName = "do.xlsx";
if (!file_exists($fileName)) {
    exit("文件".$fileName."不存在");
}
$startTime = time(); //返回当前时间Unix 时间戳
require_once './PHPExcel/IOFactory.php';
$objPHPExcel = PHPExcel_IOFactory::load($fileName);
//获取sheet表格数目
$sheetCount = $objPHPExcel->getSheetCount();
//默认选中sheet0表
$sheetSelected = 0;$objPHPExcel->setActiveSheetIndex($sheetSelected);
//获取表格行数
$rowCount = $objPHPExcel->getActiveSheet()->getHighestRow();
//获取表格列数
$columnCount = $objPHPExcel->getActiveSheet()->getHighestColumn();
echo "<div>Sheet Count : ".$sheetCount."　　行数： ".$rowCount."　　列数：".$columnCount."</div>";
$dataArr = array();

/* 循环读取每个单元格数据 */
//行数循环
for ($row = 1; $row <= $rowCount; $row++){
//列数循环 , 列数是以A列开始
for ($column = 'A'; $column <= $columnCount; $column++) {
    $dataArr[] = $objPHPExcel->getActiveSheet()->getCell($column.$row)->getValue();
    // echo $column.$row.":".$objPHPExcel->getActiveSheet()->getCell($column.$row)->getValue()."<br />";
    // $arr[$column.$row] = $objPHPExcel->getActiveSheet()->getCell($column.$row)->getValue();
}
// var_dump($arr);
// echo "<br/>消耗内存为：".(memory_get_peak_usage(true) / 1024 / 1024)."M";
$endTime = time();
// echo "<div>解析完后，当前时间为：".date("Y-m-d H:i:s")."　　　
// 总共消耗时间为：".(($endTime - $startTime))."秒</div>";
$arr[$row] = $dataArr;
// var_dump($dataArr);
if (is_numeric($dataArr['6'])) {
	$url = 'http://url.0161.org/dd/res1.php?orderno='.$dataArr[0].'&goodimg='.$dataArr[1].'&posttime='.$dataArr[2].'&successtime='.$dataArr[3].'&gotime='.$dataArr[4].'&goodno='.$dataArr[5].'&delno='.$dataArr[6].'&total='.$dataArr[7].'&single='.$dataArr[8].'&good='.$dataArr[9].'&name='.$dataArr[13].'&pay=在线支付&tel='.$dataArr[14]."&wuliu=".$dataArr[10]."&stock=".$dataArr[11]."&shouhuo=".$dataArr[12];
}
else $url = 'http://url.0161.org/dd/res.php?orderno='.$dataArr[0].'&goodimg='.$dataArr[1].'&posttime='.$dataArr[2].'&successtime='.$dataArr[3].'&gotime='.$dataArr[4].'&goodno='.$dataArr[5].'&delno='.$dataArr[6].'&total='.$dataArr[7].'&single='.$dataArr[8].'&good='.$dataArr[9].'&name='.getName().'&pay=在线支付&tel='.getTel()."&wuliu=".$dataArr[10]."&stock=".$dataArr[11]."&shouhuo=".getShouhuo();

$url = link_urldecode($url);
echo $url."<br />";
// echo $row.",".$url."<br />";
$dataArr = NULL;
}


function getName(){
	$nicheng_tou=array('快乐','冷静','醉熏','潇洒','糊涂','积极','冷酷','深情','粗暴','温柔','可爱','愉快','义气','认真','威武','帅气','传统','潇洒','漂亮','自然','专一','听话','昏睡','狂野','等待','搞怪','幽默','魁梧','活泼','开心','高兴','超帅','留胡子','坦率','直率','轻松','痴情','完美','精明','无聊','有魅力','丰富','繁荣','饱满','炙热','暴躁','碧蓝','俊逸','英勇','健忘','故意','无心','土豪','朴实','兴奋','幸福','淡定','不安','阔达','孤独','独特','疯狂','时尚','落后','风趣','忧伤','大胆','爱笑','矮小','健康','合适','玩命','沉默','斯文','香蕉','苹果','鲤鱼','鳗鱼','任性','细心','粗心','大意','甜甜','酷酷','健壮','英俊','霸气','阳光','默默','大力','孝顺','忧虑','着急','紧张','善良','凶狠','害怕','重要','危机','欢喜','欣慰','满意','跳跃','诚心','称心','如意','怡然','娇气','无奈','无语','激动','愤怒','美好','感动','激情','激昂','震动','虚拟','超级','寒冷','精明','明理','犹豫','忧郁','寂寞','奋斗','勤奋','现代','过时','稳重','热情','含蓄','开放','无辜','多情','纯真','拉长','热心','从容','体贴','风中','曾经','追寻','儒雅','优雅','开朗','外向','内向','清爽','文艺','长情','平常','单身','伶俐','高大','懦弱','柔弱','爱笑','乐观','耍酷','酷炫','神勇','年轻','唠叨','瘦瘦','无情','包容','顺心','畅快','舒适','靓丽','负责','背后','简单','谦让','彩色','缥缈','欢呼','生动','复杂','慈祥','仁爱','魔幻','虚幻','淡然','受伤','雪白','高高','糟糕','顺利','闪闪','羞涩','缓慢','迅速','优秀','聪明','含糊','俏皮','淡淡','坚强','平淡','欣喜','能干','灵巧','友好','机智','机灵','正直','谨慎','俭朴','殷勤','虚心','辛勤','自觉','无私','无限','踏实','老实','现实','可靠','务实','拼搏','个性','粗犷','活力','成就','勤劳','单纯','落寞','朴素','悲凉','忧心','洁净','清秀','自由','小巧','单薄','贪玩','刻苦','干净','壮观','和谐','文静','调皮','害羞','安详','自信','端庄','坚定','美满','舒心','温暖','专注','勤恳','美丽','腼腆','优美','甜美','甜蜜','整齐','动人','典雅','尊敬','舒服','妩媚','秀丽','喜悦','甜美','彪壮','强健','大方','俊秀','聪慧','迷人','陶醉','悦耳','动听','明亮','结实','魁梧','标致','清脆','敏感','光亮','大气','老迟到','知性','冷傲','呆萌','野性','隐形','笑点低','微笑','笨笨','难过','沉静','火星上','失眠','安静','纯情','要减肥','迷路','烂漫','哭泣','贤惠','苗条','温婉','发嗲','会撒娇','贪玩','执着','眯眯眼','花痴','想人陪','眼睛大','高贵','傲娇','心灵美','爱撒娇','细腻','天真','怕黑','感性','飘逸','怕孤独','忐忑','高挑','傻傻','冷艳','爱听歌','还单身','怕孤单','懵懂','大','D','LX','HAC','昨日','JOJO','i','Soul','bibi','evil','SS','wuli','Zz','小','哥,','随便','最爱','吴','合','xixi','无聊','-','ok','HeRose丶','Deprive','capital','time','L1uo','pamper','Martin','hysteric','Monster','Offshore','Unicorn','cleanliness','Ninety','AbNEgaTE','Ghost','Clumsy','indulge','bigotry','Vulgar_','Betrayal','Callous','Rampant','Winda','Confuse','Delusion','hold','primary','Spoil','Memorial','Appoint','care','encounter','Juvenile','Ring','Devotion','Infatuation','Chafferer','rending','Burial','Lost','Judicious','Release','Dazzling','indulge','Absurd','Miracle','Phantom','Brilliant','Iraqis','mascot','Corrupt','Suffering','Superfici','Amnesia','Rewind','Tiamo','Rangers');
	$nicheng_wei=array('嚓茶','凉面','便当','毛豆','花生','可乐','灯泡','哈密瓜','野狼','背包','眼神','缘分','雪碧','人生','牛排','蚂蚁','飞鸟','灰狼','斑马','汉堡','悟空','巨人','绿茶','自行车','保温杯','大碗','墨镜','魔镜','煎饼','月饼','月亮','星星','芝麻','啤酒','玫瑰','大叔','小伙','哈密瓜，数据线','太阳','树叶','芹菜','黄蜂','蜜粉','蜜蜂','信封','西装','外套','裙子','大象','猫咪','母鸡','路灯','蓝天','白云','星月','彩虹','微笑','摩托','板栗','高山','大地','大树','电灯胆','砖头','楼房','水池','鸡翅','蜻蜓','红牛','咖啡','机器猫','枕头','大船','诺言','钢笔','刺猬','天空','飞机','大炮','冬天','洋葱','春天','夏天','秋天','冬日','航空','毛衣','豌豆','黑米','玉米','眼睛','老鼠','白羊','帅哥','美女','季节','鲜花','服饰','裙子','白开水','秀发','大山','火车','汽车','歌曲','舞蹈','老师','导师','方盒','大米','麦片','水杯','水壶','手套','鞋子','自行车','鼠标','手机','电脑','书本','奇迹','身影','香烟','夕阳','台灯','宝贝','未来','皮带','钥匙','心锁','故事','花瓣','滑板','画笔','画板','学姐','店员','电源','饼干','宝马','过客','大白','时光','石头','钻石','河马','犀牛','西牛','绿草','抽屉','柜子','往事','寒风','路人','橘子','耳机','鸵鸟','朋友','苗条','铅笔','钢笔','硬币','热狗','大侠','御姐','萝莉','毛巾','期待','盼望','白昼','黑夜','大门','黑裤','钢铁侠','哑铃','板凳','枫叶','荷花','乌龟','仙人掌','衬衫','大神','草丛','早晨','心情','茉莉','流沙','蜗牛','战斗机','冥王星','猎豹','棒球','篮球','乐曲','电话','网络','世界','中心','鱼','鸡','狗','老虎','鸭子','雨','羽毛','翅膀','外套','火','丝袜','书包','钢笔','冷风','八宝粥','烤鸡','大雁','音响','招牌','胡萝卜','冰棍','帽子','菠萝','蛋挞','香水','泥猴桃','吐司','溪流','黄豆','樱桃','小鸽子','小蝴蝶','爆米花','花卷','小鸭子','小海豚','日记本','小熊猫','小懒猪','小懒虫','荔枝','镜子','曲奇','金针菇','小松鼠','小虾米','酒窝','紫菜','金鱼','柚子','果汁','百褶裙','项链','帆布鞋','火龙果','奇异果','煎蛋','唇彩','小土豆','高跟鞋','戒指','雪糕','睫毛','铃铛','手链','香氛','红酒','月光','酸奶','银耳汤','咖啡豆','小蜜蜂','小蚂蚁','蜡烛','棉花糖','向日葵','水蜜桃','小蝴蝶','小刺猬','小丸子','指甲油','康乃馨','糖豆','薯片','口红','超短裙','乌冬面','冰淇淋','棒棒糖','长颈鹿','豆芽','发箍','发卡','发夹','发带','铃铛','小馒头','小笼包','小甜瓜','冬瓜','香菇','小兔子','含羞草','短靴','睫毛膏','小蘑菇','跳跳糖','小白菜','草莓','柠檬','月饼','百合','纸鹤','小天鹅','云朵','芒果','面包','海燕','小猫咪','龙猫','唇膏','鞋垫','羊','黑猫','白猫','万宝路','金毛','山水','音响','JOJO','i','Soul','bibi','evil','SS','wuli','Zz','小','哥,','随便','最爱','吴','合','xixi','无聊','-','ok','HeRose丶','Deprive','capital','time','L1uo','pamper','Martin','hysteric','Monster','Offshore','Unicorn','cleanliness','Ninety','AbNEgaTE','Ghost','Clumsy','indulge','bigotry','Vulgar_','Betrayal','Callous','Rampant','Winda','Confuse','Delusion','hold','primary','Spoil','Memorial','Appoint','care','encounter','Juvenile','Ring','Devotion','Infatuation','Chafferer','rending','Burial','Lost','Judicious','Release','Dazzling','indulge','Absurd','Miracle','Phantom','Brilliant','Iraqis','mascot','Corrupt','Suffering','Superfici','Amnesia','Rewind','Tiamo','Rangers');
	$tou_num=rand(0,count($nicheng_tou)-1);
	$wei_num=rand(0,count($nicheng_wei)-1);
	$nicheng=$nicheng_tou[$tou_num].$nicheng_wei[$wei_num];
	return $nicheng; //输出生成昵称
}


function getTel(){
	$tel_tou = array(
		"134","135","137","138","139","147","150","151","152","157","158","159","182","187","188","189","130","131","132","155","156","185","186","133","153","180","189","176",
	);
	$rand_tou = rand(0,27);
	$tel = "86 ".$tel_tou[$rand_tou]."****".rand(0000,9999);
	return $tel;
}

function getShouhuo(){
	// 1.北京市 2.天津市 3.上海市 4.重庆市 5.河北省 6.山西省 7.辽宁省 8.吉林省 9.黑龙江省 10.江苏省 11.浙江省 12.安徽省 13.福建省 14.江西省 15.山东省 16.河南省 17.湖北省 18.湖南省 19.广东省 20.海南省 21.四川省
	$p = array(
		'北京市',
		'天津市',
		'上海市', 
		'重庆市', 
		'河北省', 
		'山西省', 
		'辽宁省', 
		'吉林省', 
		'黑龙江省',
		'江苏省', 
		'浙江省', 
		'安徽省', 
		'福建省', 
		'江西省', 
		'山东省', 
		'河南省', 
		'湖北省', 
		'湖南省', 
		'广东省', 
		'海南省', 
		'四川省',
	);
	$shouhuo_tou = array(
		array('东城区','西城区','朝阳区','丰台区','石景山区','海淀区','顺义区','通州区','大兴区','房山区','门头沟区','昌平区','平谷区','密云区','怀柔区','延庆区'),
		array('河西区','和平区','河东区','南开区','河北区','红桥区','东丽区','西青区','津南区','北辰区','武清区','宝坻区','滨海新区','宁河区','静海区','蓟州区'),
		array('黄浦区','静安区','徐汇区','长宁区','杨浦区','虹口区','宝山区','嘉定区','闵行区','松江区','青浦区','奉贤区','金山区' ),
		array('万州区','黔江区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','渝北区','巴南区','长寿区','江津区','合川区','永川区','南川区','綦江区','大足区','铜梁区','璧山区'),
		array('石家庄市','唐山','邯郸市','保定市','沧州市','邢台市','廊坊','承德市','张家口','衡水','秦皇岛'),
		array('大同市', '朔州市','阳泉市' ,'长治市' ,'晋城市' ,'忻州市' ,'晋中市' ,'临汾市' ,'运城市' ,'吕梁市'),
		array('沈阳市','大连市','鞍山市','抚顺市','本溪市','丹东市','锦州市','营口市','阜新市','辽阳市','盘锦市','铁岭市','朝阳市','葫芦岛市','新民市','瓦房店市','普兰店市','庄河市','海城市','东港市','凤城市','凌海市','北镇市','大石桥市','盖州市','灯塔市','调兵山市','开原市','凌源市','北票市','兴城市'),
		array('长春市','吉林市' ,'四平市','辽源市','通化市','白山市' ,'松原市','白城市'),
		array('哈尔滨市','齐齐哈尔市','牡丹江市','佳木斯市','七台河市','大庆市','黑河市','绥化市','伊春市','鹤岗市','双鸭山市','鸡西市'),
		array('南京市','无锡市','徐州市','常州市','苏州市','南通市','连云港市','淮安市','盐城市','扬州市','镇江市','泰州市','宿迁市'),
		array('杭州市','湖州市','绍兴市','宁波市','嘉兴市','丽水市','台州市','温州市','金华市','衢州市','舟山'),
		array('宿州市','淮北市','亳州市','阜阳','蚌埠','淮南市','滁州','六安','马鞍山市','安庆','芜湖市','铜陵市','宣城','池州','黄山市'),
		array('福州市','厦门市' ,'泉州市' ,'宁德市' ,'龙岩市' ,'漳州市' ,'三明市' ,'南平市' ,'莆田市'),
		array('南昌市','九江市','上饶市','抚州市','宜春市','吉安市','赣州市','景德镇市','萍乡市','新余市','鹰潭市'),
		array('济南市','青岛市','淄博','枣庄','东营','烟台市','潍坊','济宁市','泰安市','威海','日照','滨州市','德州市','聊城','临沂市','菏泽','莱芜'),
		array('郑州市','开封市','洛阳市','平顶山','安阳市','鹤壁','新乡市','焦作市','濮阳市','许昌市','漯河','三门峡','南阳市','商丘市','信阳市','周口','驻马店'),
		array('武汉市','黄石市','襄阳市','荆州市','宜昌市','十堰市','孝感市','荆门市','鄂州市','黄冈市','咸宁市','随州市'),
		array('长沙市','株洲市','湘潭市','衡阳市','邵阳市','岳阳市','常德市','张家界市','益阳市','郴州市','永州市','怀化市','娄底市'),
		array('珠海市','汕头市','佛山市','韶关市','湛江市','肇庆市','江门市','茂名市','惠州市','梅州市','汕尾市','河源市','阳江市','清远市','东莞市','中山市','潮州市','揭阳市','云浮市'),
		array('海口市','三亚市','儋州市','五指山市' ,'文昌市','琼海市','万宁市','东方市'),
		array('成都市','自贡市','攀枝花','泸州市','德阳市','绵阳市','广元市','遂宁市','内江市','乐山市','南充市','眉山市','宜宾市','广安市','达州市','雅安市','巴中市','资阳市'),
	);
	$lu_r = array(
		'文','武','安','雅','学','中','晓','音','瑶','浅','染','晚','榛','可','懿','展','熙','绫','辰','瑛','倩','真','若','咏','桐','然','诺','清','叶','璃','欣','轻','颜','君','春','东','腾','春','丰','远','雨','安','宏','昌','裕','恒','泽','万','嘉','美','源','瑞','茂','祥','隆','树','伍','河',
	);
	$qu_r = array(
		'小区','花园','之光','城','大厦','公馆','苑',
	);
	$lu = $lu_r[rand(0,count($lu_r)-1)].$lu_r[rand(0,count($lu_r)-1)]."路";
	$qu = $lu_r[rand(0,count($lu_r)-1)].$lu_r[rand(0,count($lu_r)-1)].$qu_r[rand(0,count($qu_r)-1)];
	$rp = rand(5,count($p)-1);
	// echo $p[$rp].$shouhuo_tou[$rp][rand(0,count($shouhuo_tou[$rp])-1)].$lu.$qu.rand(1,100)."号楼 ".rand(1,10)."单元 ";

	$shouhuo = $p[$rp]." ".$shouhuo_tou[$rp][rand(0,count($shouhuo_tou[$rp])-1)]." ".$lu." ".$qu.rand(1,100)."号楼 ".rand(1,10)."单元 ".rand(1,34)."0".rand(1,9)."室";
	return $shouhuo;
}
function link_urldecode($url) {
  $uri = '';
  $cs = unpack('C*', $url);
  $len = count($cs);
  for ($i=1; $i<=$len; $i++) {
    $uri .= $cs[$i] > 127 ? '%'.strtoupper(dechex($cs[$i])) : $url{$i-1};
  }
  return $uri;
}
// echo "<br />得到最终数据为：";
// var_dump($arr);